dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxDma_reg.h
/** \brief 1F44, DMA Channel 81 Transaction State Register */
#define DMA_TSR81 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F44u)
/** Alias (User Manual Name) for DMA_TSR81.
* To use register names with standard convension, please use DMA_TSR81.
*/
#define DMA_TSR081 (DMA_TSR81)

/** \brief 1F48, DMA Channel 82 Transaction State Register */
#define DMA_TSR82 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F48u)
/** Alias (User Manual Name) for DMA_TSR82.
* To use register names with standard convension, please use DMA_TSR82.
*/
#define DMA_TSR082 (DMA_TSR82)

/** \brief 1F4C, DMA Channel 83 Transaction State Register */
#define DMA_TSR83 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F4Cu)
/** Alias (User Manual Name) for DMA_TSR83.
* To use register names with standard convension, please use DMA_TSR83.
*/
#define DMA_TSR083 (DMA_TSR83)

/** \brief 1F50, DMA Channel 84 Transaction State Register */
#define DMA_TSR84 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F50u)
/** Alias (User Manual Name) for DMA_TSR84.
* To use register names with standard convension, please use DMA_TSR84.
*/
#define DMA_TSR084 (DMA_TSR84)

/** \brief 1F54, DMA Channel 85 Transaction State Register */
#define DMA_TSR85 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F54u)
/** Alias (User Manual Name) for DMA_TSR85.
* To use register names with standard convension, please use DMA_TSR85.
*/
#define DMA_TSR085 (DMA_TSR85)

/** \brief 1F58, DMA Channel 86 Transaction State Register */
#define DMA_TSR86 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F58u)
/** Alias (User Manual Name) for DMA_TSR86.
* To use register names with standard convension, please use DMA_TSR86.
*/
#define DMA_TSR086 (DMA_TSR86)

/** \brief 1F5C, DMA Channel 87 Transaction State Register */
#define DMA_TSR87 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F5Cu)
/** Alias (User Manual Name) for DMA_TSR87.
* To use register names with standard convension, please use DMA_TSR87.
*/
#define DMA_TSR087 (DMA_TSR87)

/** \brief 1F60, DMA Channel 88 Transaction State Register */
#define DMA_TSR88 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F60u)
/** Alias (User Manual Name) for DMA_TSR88.
* To use register names with standard convension, please use DMA_TSR88.
*/
#define DMA_TSR088 (DMA_TSR88)

/** \brief 1F64, DMA Channel 89 Transaction State Register */
#define DMA_TSR89 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F64u)
/** Alias (User Manual Name) for DMA_TSR89.
* To use register names with standard convension, please use DMA_TSR89.
*/
#define DMA_TSR089 (DMA_TSR89)

/** \brief 1F68, DMA Channel 90 Transaction State Register */
#define DMA_TSR90 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F68u)
/** Alias (User Manual Name) for DMA_TSR90.
* To use register names with standard convension, please use DMA_TSR90.
*/
#define DMA_TSR090 (DMA_TSR90)

/** \brief 1F6C, DMA Channel 91 Transaction State Register */
#define DMA_TSR91 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F6Cu)
/** Alias (User Manual Name) for DMA_TSR91.
* To use register names with standard convension, please use DMA_TSR91.
*/
#define DMA_TSR091 (DMA_TSR91)

/** \brief 1F70, DMA Channel 92 Transaction State Register */
#define DMA_TSR92 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F70u)
/** Alias (User Manual Name) for DMA_TSR92.
* To use register names with standard convension, please use DMA_TSR92.
*/
#define DMA_TSR092 (DMA_TSR92)

/** \brief 1F74, DMA Channel 93 Transaction State Register */
#define DMA_TSR93 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F74u)
/** Alias (User Manual Name) for DMA_TSR93.
* To use register names with standard convension, please use DMA_TSR93.
*/
#define DMA_TSR093 (DMA_TSR93)

/** \brief 1F78, DMA Channel 94 Transaction State Register */
#define DMA_TSR94 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F78u)
/** Alias (User Manual Name) for DMA_TSR94.
* To use register names with standard convension, please use DMA_TSR94.
*/
#define DMA_TSR094 (DMA_TSR94)

/** \brief 1F7C, DMA Channel 95 Transaction State Register */
#define DMA_TSR95 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F7Cu)
/** Alias (User Manual Name) for DMA_TSR95.
* To use register names with standard convension, please use DMA_TSR95.
*/
#define DMA_TSR095 (DMA_TSR95)

/** \brief 1F80, DMA Channel 96 Transaction State Register */
#define DMA_TSR96 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F80u)
/** Alias (User Manual Name) for DMA_TSR96.
* To use register names with standard convension, please use DMA_TSR96.
*/
#define DMA_TSR096 (DMA_TSR96)

/** \brief 1F84, DMA Channel 97 Transaction State Register */
#define DMA_TSR97 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F84u)
/** Alias (User Manual Name) for DMA_TSR97.
* To use register names with standard convension, please use DMA_TSR97.
*/
#define DMA_TSR097 (DMA_TSR97)

/** \brief 1F88, DMA Channel 98 Transaction State Register */
#define DMA_TSR98 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F88u)
/** Alias (User Manual Name) for DMA_TSR98.
* To use register names with standard convension, please use DMA_TSR98.
*/
#define DMA_TSR098 (DMA_TSR98)

/** \brief 1F8C, DMA Channel 99 Transaction State Register */
#define DMA_TSR99 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F8Cu)
/** Alias (User Manual Name) for DMA_TSR99.
* To use register names with standard convension, please use DMA_TSR99.
*/
#define DMA_TSR099 (DMA_TSR99)

/** \brief 1F90, DMA Channel 100 Transaction State Register */
#define DMA_TSR100 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F90u)

/** \brief 1F94, DMA Channel 101 Transaction State Register */
#define DMA_TSR101 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F94u)

/** \brief 1F98, DMA Channel 102 Transaction State Register */
#define DMA_TSR102 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F98u)

/** \brief 1F9C, DMA Channel 103 Transaction State Register */
#define DMA_TSR103 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F9Cu)

/** \brief 1FA0, DMA Channel 104 Transaction State Register */
#define DMA_TSR104 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FA0u)

/** \brief 1FA4, DMA Channel 105 Transaction State Register */
#define DMA_TSR105 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FA4u)

/** \brief 1FA8, DMA Channel 106 Transaction State Register */
#define DMA_TSR106 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FA8u)

/** \brief 1FAC, DMA Channel 107 Transaction State Register */
#define DMA_TSR107 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FACu)

/** \brief 1FB0, DMA Channel 108 Transaction State Register */
#define DMA_TSR108 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FB0u)

/** \brief 1FB4, DMA Channel 109 Transaction State Register */
#define DMA_TSR109 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FB4u)

/** \brief 1FB8, DMA Channel 110 Transaction State Register */
#define DMA_TSR110 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FB8u)

/** \brief 1FBC, DMA Channel 111 Transaction State Register */
#define DMA_TSR111 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FBCu)

/** \brief 1FC0, DMA Channel 112 Transaction State Register */
#define DMA_TSR112 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FC0u)

