dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxDma_reg.h
/** \brief 2E3C, DMARAM Channel 113 Control and Status Register */
#define DMA_CH113_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012E3Cu)
/** Alias (User Manual Name) for DMA_CH113_CHCSR.
* To use register names with standard convension, please use DMA_CH113_CHCSR.
*/
#define DMA_CHCSR113 (DMA_CH113_CHCSR)

/** \brief 2E40, DMARAM Channel 114 Read Data CRC Register */
#define DMA_CH114_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012E40u)
/** Alias (User Manual Name) for DMA_CH114_RDCRCR.
* To use register names with standard convension, please use DMA_CH114_RDCRCR.
*/
#define DMA_RDCRCR114 (DMA_CH114_RDCRCR)

/** \brief 2E44, DMARAM Channel 114 Source and Destination Address CRC Register */
#define DMA_CH114_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012E44u)
/** Alias (User Manual Name) for DMA_CH114_SDCRCR.
* To use register names with standard convension, please use DMA_CH114_SDCRCR.
*/
#define DMA_SDCRCR114 (DMA_CH114_SDCRCR)

/** \brief 2E48, DMARAM Channel 114 Source Address Register */
#define DMA_CH114_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012E48u)
/** Alias (User Manual Name) for DMA_CH114_SADR.
* To use register names with standard convension, please use DMA_CH114_SADR.
*/
#define DMA_SADR114 (DMA_CH114_SADR)

/** \brief 2E4C, DMARAM Channel 114 Destination Address Register */
#define DMA_CH114_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012E4Cu)
/** Alias (User Manual Name) for DMA_CH114_DADR.
* To use register names with standard convension, please use DMA_CH114_DADR.
*/
#define DMA_DADR114 (DMA_CH114_DADR)

/** \brief 2E50, DMARAM Channel 114 Address and Interrupt Control Register */
#define DMA_CH114_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012E50u)
/** Alias (User Manual Name) for DMA_CH114_ADICR.
* To use register names with standard convension, please use DMA_CH114_ADICR.
*/
#define DMA_ADICR114 (DMA_CH114_ADICR)

/** \brief 2E54, DMARAM Channel 114 Configuration Register */
#define DMA_CH114_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012E54u)
/** Alias (User Manual Name) for DMA_CH114_CHCFGR.
* To use register names with standard convension, please use DMA_CH114_CHCFGR.
*/
#define DMA_CHCFGR114 (DMA_CH114_CHCFGR)

/** \brief 2E58, DMARAM Channel 114 Shadow Address Register */
#define DMA_CH114_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012E58u)
/** Alias (User Manual Name) for DMA_CH114_SHADR.
* To use register names with standard convension, please use DMA_CH114_SHADR.
*/
#define DMA_SHADR114 (DMA_CH114_SHADR)

/** \brief 2E5C, DMARAM Channel 114 Control and Status Register */
#define DMA_CH114_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012E5Cu)
/** Alias (User Manual Name) for DMA_CH114_CHCSR.
* To use register names with standard convension, please use DMA_CH114_CHCSR.
*/
#define DMA_CHCSR114 (DMA_CH114_CHCSR)

/** \brief 2E60, DMARAM Channel 115 Read Data CRC Register */
#define DMA_CH115_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012E60u)
/** Alias (User Manual Name) for DMA_CH115_RDCRCR.
* To use register names with standard convension, please use DMA_CH115_RDCRCR.
*/
#define DMA_RDCRCR115 (DMA_CH115_RDCRCR)

/** \brief 2E64, DMARAM Channel 115 Source and Destination Address CRC Register */
#define DMA_CH115_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012E64u)
/** Alias (User Manual Name) for DMA_CH115_SDCRCR.
* To use register names with standard convension, please use DMA_CH115_SDCRCR.
*/
#define DMA_SDCRCR115 (DMA_CH115_SDCRCR)

/** \brief 2E68, DMARAM Channel 115 Source Address Register */
#define DMA_CH115_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012E68u)
/** Alias (User Manual Name) for DMA_CH115_SADR.
* To use register names with standard convension, please use DMA_CH115_SADR.
*/
#define DMA_SADR115 (DMA_CH115_SADR)

/** \brief 2E6C, DMARAM Channel 115 Destination Address Register */
#define DMA_CH115_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012E6Cu)
/** Alias (User Manual Name) for DMA_CH115_DADR.
* To use register names with standard convension, please use DMA_CH115_DADR.
*/
#define DMA_DADR115 (DMA_CH115_DADR)

/** \brief 2E70, DMARAM Channel 115 Address and Interrupt Control Register */
#define DMA_CH115_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012E70u)
/** Alias (User Manual Name) for DMA_CH115_ADICR.
* To use register names with standard convension, please use DMA_CH115_ADICR.
*/
#define DMA_ADICR115 (DMA_CH115_ADICR)

/** \brief 2E74, DMARAM Channel 115 Configuration Register */
#define DMA_CH115_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012E74u)
/** Alias (User Manual Name) for DMA_CH115_CHCFGR.
* To use register names with standard convension, please use DMA_CH115_CHCFGR.
*/
#define DMA_CHCFGR115 (DMA_CH115_CHCFGR)

/** \brief 2E78, DMARAM Channel 115 Shadow Address Register */
#define DMA_CH115_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012E78u)
/** Alias (User Manual Name) for DMA_CH115_SHADR.
* To use register names with standard convension, please use DMA_CH115_SHADR.
*/
#define DMA_SHADR115 (DMA_CH115_SHADR)

/** \brief 2E7C, DMARAM Channel 115 Control and Status Register */
#define DMA_CH115_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012E7Cu)
/** Alias (User Manual Name) for DMA_CH115_CHCSR.
* To use register names with standard convension, please use DMA_CH115_CHCSR.
*/
#define DMA_CHCSR115 (DMA_CH115_CHCSR)

/** \brief 2E80, DMARAM Channel 116 Read Data CRC Register */
#define DMA_CH116_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012E80u)
/** Alias (User Manual Name) for DMA_CH116_RDCRCR.
* To use register names with standard convension, please use DMA_CH116_RDCRCR.
*/
#define DMA_RDCRCR116 (DMA_CH116_RDCRCR)

/** \brief 2E84, DMARAM Channel 116 Source and Destination Address CRC Register */
#define DMA_CH116_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012E84u)
/** Alias (User Manual Name) for DMA_CH116_SDCRCR.
* To use register names with standard convension, please use DMA_CH116_SDCRCR.
*/
#define DMA_SDCRCR116 (DMA_CH116_SDCRCR)

/** \brief 2E88, DMARAM Channel 116 Source Address Register */
#define DMA_CH116_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012E88u)
/** Alias (User Manual Name) for DMA_CH116_SADR.
* To use register names with standard convension, please use DMA_CH116_SADR.
*/
#define DMA_SADR116 (DMA_CH116_SADR)

